<a href="https://colab.research.google.com/github/vinifred29/mashiya-s-LU-datascience-assignments/blob/main/Day_4_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
print(pd.__version__)

1.1.4

In [11]:
import pandas as pd
import numpy as np

d=np.array([1,2,3,"hello", "kitty","pink"])
s=pd.Series(d)
print(s)

print()

print(type(s))

0        1
1        2
2        3
3    hello
4    kitty
5     pink
dtype: object

<class 'pandas.core.series.Series'>

In [14]:
s=pd.Series(d,index=['a','b','c','d','e','f'])
print(s)
print()
print()
d1=s.to_frame().reset_index()
d1.columns=["options","Names"]
d1

a        1
b        2
c        3
d    hello
e    kitty
f     pink
dtype: object

  options  Names
0       a      1
1       b      2
2       c      3
3       d  hello
4       e  kitty
5       f   pink

In [15]:
import seaborn as sb

print(sb.__version__)

0.11.0

In [20]:
sb.get_dataset_names

In [24]:
mpg= sb.load_dataset('mpg')
print(mpg.shape)
print()
print(mpg)

(398, 9)

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [25]:
mpg=sb.load_dataset('mpg')
mpg['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [26]:
mpg=sb.load_dataset('mpg')
d1=pd.DataFrame(mpg)
d1[d1['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]